# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-eid'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
#brew 'awscli'
brew 'bash' # Latest Bash version
#brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'gnupg2'
brew 'grep'
#brew 'httpie'
#brew 'hub'
brew 'mackup'
#brew 'mas' # Mac App Store manager
#brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
#brew 'trash' # Manage the Trash bin
#brew 'tree' # List directories in a tree structure
#brew 'zlib' # Needed for Memcached

# Development
brew 'php'
brew 'composer'
#brew 'mariadb'
brew 'nginx'
brew 'node'
#brew 'redis'
brew 'yarn'

# Apps
cask '1password'
cask 'alfred'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'github'
cask 'google-chrome'
cask 'gpg-suite'
cask 'insomnia'
cask 'iterm2'
#cask 'sequel-pro'
cask 'slack'
cask 'sublime-text'
cask 'tableplus'
cask 'tinkerwell'
cask 'transmit'
cask 'visual-studio-code'

# Quicklook
#cask 'qlcolorcode'
#cask 'qlmarkdown'
#cask 'quicklook-json'
#cask 'quicklook-csv'
#cask 'qlstephen'

# Fonts
cask 'font-fira-code'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-roboto-condensed'
#cask 'font-source-code-pro-for-powerline'
#cask 'font-source-code-pro'
#cask 'font-source-sans-pro'
#cask 'font-source-serif-pro'
